app/controllers/paintings_controller.rb

	def create

		@painting = Painting.new(params[:painting])
		@painting.save!
---
INSERT INTO `paintings` (`created_at`, `image`, `updated_at`) VALUES ('2013-06-22 17:08:37', '12100022-C08.jpg', '2013-06-22 17:08:37')

	def index
		@paintings = Painting.all
---
SELECT `paintings`.* FROM `paintings`

	def destroy
		@painting = Painting.find(params[:id])
		@painting.destroy
---
SELECT `paintings`.* FROM `paintings` WHERE `paintings`.`id` = 2 LIMIT 1
DELETE FROM `paintings` WHERE `paintings`.`id` = 2